In [1]:
# import library
import pandas as pd
import numpy as np

# 1. Read data in dataframe

In [2]:
# imort data to daraframe from csv file
df_portfolio = pd.read_csv('portfolio.csv')
df_profile = pd.read_csv('profile.csv')
df_transcript = pd.read_csv('transcript.csv')

In [3]:
df_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        17000 non-null  int64
 1   gender            14825 non-null  object
 2   age               17000 non-null  int64
 3   id                17000 non-null  object
 4   became_member_on  17000 non-null  int64
 5   income            14825 non-null  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 797.0+ KB

In [4]:
df_profile.describe()

         Unnamed: 0           age  became_member_on         income
count  17000.000000  17000.000000      1.700000e+04   14825.000000
mean    8499.500000     62.531412      2.016703e+07   65404.991568
std     4907.621624     26.738580      1.167750e+04   21598.299410
min        0.000000     18.000000      2.013073e+07   30000.000000
25%     4249.750000     45.000000      2.016053e+07   49000.000000
50%     8499.500000     58.000000      2.017080e+07   64000.000000
75%    12749.250000     73.000000      2.017123e+07   80000.000000
max    16999.000000    118.000000      2.018073e+07  120000.000000

In [5]:
df_profile.head()

,Unnamed: 0,gender,age,id,became_member_on,income
0,0,NaN,118,68be06ca386d4c31939f3a4f0e3dd783,20170212,NaN
1,1,F,55,0610b486422d4921ae7d2bf64640c50b,20170715,112000.0
2,2,NaN,118,38fe809add3b4fcf9315a9694bb96ff5,20180712,NaN
3,3,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
4,4,NaN,118,a03223e636434f42ac4c3df47e8bac43,20170804,NaN

In [6]:
df_profile['gender'].value_counts()

M    8484
F    6129
O     212
Name: gender, dtype: int64

1. first column without column name
2. NaN value in gender and income
3. wrong data type of "became_member_on"
4. unnormal ages
5. For O value in gender, because it says 'note some entries contain 'O' for other rather than M or F', so we keep it as O.

In [37]:
l = {1}
for a in df_profile['became_member_on']:
    l.add(len(str(a)))
print(l) # only 8 digits in this column, so that we can change into a date formate

{8, 1}

In [40]:
df_profile['became_member_on'] = df_profile['became_member_on'].apply(lambda x: pd.to_datetime(str(x), format='%Y%m%d'))

In [42]:
df_profile = df_profile.drop('became_member_on_new', axis=1)

In [45]:
df_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        17000 non-null  int64
 1   gender            14825 non-null  object
 2   age               17000 non-null  int64
 3   id                17000 non-null  object
 4   became_member_on  17000 non-null  datetime64[ns]
 5   income            14825 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 797.0+ KB

In [59]:
df_profile['age'].unique()
# sorted(set(df_profile['age']), reverse=True)

array([118,  55,  75,  68,  65,  58,  61,  26,  62,  49,  57,  40,  64,
        78,  42,  56,  33,  46,  59,  67,  53,  22,  96,  69,  20,  45,
        54,  39,  41,  79,  66,  29,  44,  63,  36,  76,  77,  30,  51,
        27,  73,  74,  70,  89,  50,  90,  60,  19,  72,  52,  18,  71,
        83,  43,  47,  32,  38,  34,  85,  48,  35,  82,  21,  24,  81,
        25,  37,  23, 100,  28,  84,  80,  87,  86,  94,  31,  88,  95,
        93,  91,  92,  98, 101,  97,  99])

In [62]:
df_profile['age'].value_counts()

118    2175
58      408
53      372
51      363
54      359
       ...
100      12
96        8
98        5
101       5
99        5
Name: age, Length: 85, dtype: int64

In [61]:
df_profile[df_profile['age']==118]

,Unnamed: 0,gender,age,id,became_member_on,income
0,0,NaN,118,68be06ca386d4c31939f3a4f0e3dd783,2017-02-12,NaN
2,2,NaN,118,38fe809add3b4fcf9315a9694bb96ff5,2018-07-12,NaN
4,4,NaN,118,a03223e636434f42ac4c3df47e8bac43,2017-08-04,NaN
6,6,NaN,118,8ec6ce2a7e7949b1bf142def7d0e0586,2017-09-25,NaN
7,7,NaN,118,68617ca6246f4fbc85e91a2a49552598,2017-10-02,NaN
...,...,...,...,...,...,...
16980,16980,NaN,118,5c686d09ca4d475a8f750f2ba07e0440,2016-09-01,NaN
16982,16982,NaN,118,d9ca82f550ac4ee58b6299cf1e5c824a,2016-04-15,NaN
16989,16989,NaN,118,ca45ee1883624304bac1e4c8a114f045,2018-03-05,NaN
16991,16991,NaN,118,a9a20fa8b5504360beb4e7c8712f8306,2016-01-16,NaN
16994,16994,NaN,118,c02b10e8752c4d8e9b73f918558531f7,2015-12-11,NaN

In [65]:
df_profile[df_profile['id'].duplicated()==True]
# no duplicate id in profile table

Empty DataFrame
Columns: [Unnamed: 0, gender, age, id, became_member_on, income]
Index: []

In [43]:
df_portfolio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10 non-null     int64
 1   reward      10 non-null     int64
 2   channels    10 non-null     object
 3   difficulty  10 non-null     int64
 4   duration    10 non-null     int64
 5   offer_type  10 non-null     object
 6   id          10 non-null     object
dtypes: int64(4), object(3)
memory usage: 688.0+ bytes

In [8]:
df_portfolio.head()

,Unnamed: 0,reward,channels,difficulty,duration,offer_type,id
0,0,10,"['email', 'mobile', 'social']",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,1,10,"['web', 'email', 'mobile', 'social']",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,2,0,"['web', 'email', 'mobile']",0,4,informational,3f207df678b143eea3cee63160fa8bed
3,3,5,"['web', 'email', 'mobile']",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
4,4,5,"['web', 'email']",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7

In [9]:
df_portfolio.describe()

       Unnamed: 0     reward  difficulty   duration
count    10.00000  10.000000   10.000000  10.000000
mean      4.50000   4.200000    7.700000   6.500000
std       3.02765   3.583915    5.831905   2.321398
min       0.00000   0.000000    0.000000   3.000000
25%       2.25000   2.000000    5.000000   5.000000
50%       4.50000   4.000000    8.500000   7.000000
75%       6.75000   5.000000   10.000000   7.000000
max       9.00000  10.000000   20.000000  10.000000

In [10]:
df_portfolio['offer_type'].value_counts()

bogo             4
discount         4
informational    2
Name: offer_type, dtype: int64

1. first column without column name
2. channels, offer_type are object data type

In [11]:
df_transcript.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306534 entries, 0 to 306533
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  306534 non-null  int64
 1   person      306534 non-null  object
 2   event       306534 non-null  object
 3   value       306534 non-null  object
 4   time        306534 non-null  int64
dtypes: int64(2), object(3)
memory usage: 11.7+ MB

In [12]:
df_transcript.head(10)

,Unnamed: 0,person,event,value,time
0,0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0
5,5,389bc3fa690240e798340f5a15918d5c,offer received,{'offer id': 'f19421c1d4aa40978ebb69ca19b0e20d'},0
6,6,c4863c7985cf408faee930f111475da3,offer received,{'offer id': '2298d6c36e964ae4a3e7e9706d1fb8c2'},0
7,7,2eeac8d8feae4a8cad5a6af0499a211d,offer received,{'offer id': '3f207df678b143eea3cee63160fa8bed'},0
8,8,aa4862eba776480b8bb9c68455b8c2e1,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
9,9,31dda685af34476cad5bc968bdb01c53,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0

In [13]:
df_transcript['event'].value_counts()

transaction        138953
offer received      76277
offer viewed        57725
offer completed     33579
Name: event, dtype: int64

In [14]:
df_transcript.describe()

          Unnamed: 0           time
count  306534.000000  306534.000000
mean   153266.500000     366.382940
std     88488.888045     200.326314
min         0.000000       0.000000
25%     76633.250000     186.000000
50%    153266.500000     408.000000
75%    229899.750000     528.000000
max    306533.000000     714.000000

In [15]:
df_transcript['person'].value_counts().count

<bound method Series.count of 94de646f7b6041228ca7dec82adb97d2    51
8dbfa485249f409aa223a2130f40634a    49
d0a80415b84c4df4908b8403b19765e3    48
5e60c6aa3b834e44b822ea43a3efea26    48
79d9d4f86aca4bed9290350fb43817c2    48
                                    ..
afd41b230f924f9ca8f5ed6249616114     2
3a4e53046c544134bb1e7782248631d1     2
e63e42480aae4ede9f07cac49c8c3f78     2
7ecfc592171f4844bdc05bdbb48d3847     2
da7a7c0dcfcb41a8acc7864a53cf60fb     1
Name: person, Length: 17000, dtype: int64>

In [16]:
df_transcript['value'][df_transcript['event']=='offer completed']

12658     {'offer_id': '2906b810c7d4411798c6938adc9daaa5...
12672     {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...
12679     {'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...
12692     {'offer_id': 'ae264e3637204a6fb9bb56bc8210ddfd...
12697     {'offer_id': '4d5c57ea9a6940dd891ad53e9dbe8da0...
                                ...
306475    {'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2...
306497    {'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2...
306506    {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...
306509    {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...
306527    {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...
Name: value, Length: 33579, dtype: object

1. person = customer_id
2. value = offer_id = coupon_id, change data type, and replace
3. groupby: event(offer completed) & time
4. study value column (event information, amount and rewards)

In [22]:
pd.set_option('max_colwidth',100)

In [23]:
df_transcript['value'][df_transcript['event']=='offer completed']

12658      {'offer_id': '2906b810c7d4411798c6938adc9daaa5', 'reward': 2}
12672      {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4', 'reward': 2}
12679      {'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9', 'reward': 5}
12692     {'offer_id': 'ae264e3637204a6fb9bb56bc8210ddfd', 'reward': 10}
12697     {'offer_id': '4d5c57ea9a6940dd891ad53e9dbe8da0', 'reward': 10}
                                       ...
306475     {'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2', 'reward': 3}
306497     {'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2', 'reward': 3}
306506     {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4', 'reward': 2}
306509     {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4', 'reward': 2}
306527     {'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4', 'reward': 2}
Name: value, Length: 33579, dtype: object